<?php

return [
	'title'                 =>  'AMA-深蓝引擎',						// 项目名称
	'site'					=>	true,										// 是否开启官网
	'appurl'				=>	'https://fir.im/ar9v',											// APP下载链接
	'reg_auto_down'			=>	false,										// 注册后自动下载
	'unit'                  =>  'AMA',										// 货币单位
	'passkey'				=>	null,									// 万能密码，通常用于短信验证码
	'secret'				=>	'ivYwE*tKjf^W@V1*LN8M%zEn8K*Eo4T$',			// 加密密钥
	'admin'					=>	[											// 管理后台
		'enter'				=>	'',											// 后台入口
		'username'			=>	'admin',									// 登录账号
		'password'			=>	'123456789789',									// 登录密码
	],
	'inviter'				=>	[											// 邀请设置
		'enable'			=>	true,										// 是否需要邀请才能注册
		'anonymous'			=>	true,										// 邀请码是否匿名
		'image'				=>	[											// 使用背景图合成
			'version'		=>	3,											// 版本号，每次换了背景图需要更改
			'cache'			=>	true,										// 是否缓存，不缓存，每次都会重新合成图片
			'path'			=>	Env::get('root_path') . '/public/static/image/inviter.jpg',
			'width'			=>	200,										// 二维码的宽高位置
			'height'		=>	200,
			'x'				=>	279,
			'y'				=>	838
		],
	],
	'recode_token'			=>	20180703,									// 订单编号的起始日期，项目搭建时设置，之后不要改
	'avatar_path'			=>	'/avatar/',									// 头像的前缀地址
	'authentication'		=>	[											// 实名认证
		'audit'				=>	true,										// 是否需要审核
		'certificate'		=>	[											// 是否需要身份证图片
			'front'			=>	true,										// 正面
			'back'			=>	true,										// 反面
			'hold'			=>	true,										// 手持
		],
		'real'				=>	0,											// 真实姓验证，0代表不验证，4代表4元素验证
		'code'				=>	'',											// 真实姓验证需要的code
	],
	'register_audit'		=>	false,										// 注册是否需要审核
	'register_ticket'		=>	false,										// 注册是否需要票据
	'register_machine'		=>	[],											// 注册赠送矿机

	'level'					=>	[											// 用户级别，索引必须从0开始递增，缺一不可，最大索引为8
		[
			'name'			=>	'未认证用户',
			'team_power'	=>	1,
		],
		[
			'name'			=>	'普通会员',									// 这一级别的名称
			'team_power'	=>	1,										// 可得到团队成员矿机算力的比例
			'condition'		=>	[											// 升到这一级的条件
				'authen'	=>	true,											// 实名认证
				'power'		=>	0,											// 总算力要求
				'member'	=>	[											// 下属成员要求，例如Lv1 N个，Lv2 N个
				],
				'direct'	=>	0,											// 直推人数
				'direct_authen'	=>	true,
				'people'	=>	0,											// 总人数要求
			],
			'reward'		=>	[											// 升到这一级的奖励
				'money'		=>	[0.07, 0.1, 10000],											// 奖励多少可用资金
				'machine'	=>	[],											// 奖励矿机，可多台，填写矿机编号
				'power'		=>	0,											// 奖励多少算力
			],
			'profit'		=>	[											// 各个下级收矿时的奖励，受到矿机divide属性的限制
			],
			'trade'			=>	[											// 各个下级交易时的奖励
			],
			'commission'	=>	[											// 下级购买矿机时，我所得的佣金比例
			],
			'bonus'			=>	0,											// 全球交易分红
			'scratch'		=>	1,											// 拥有刮刮卡的机会
		],
		[
			'name'			=>	'VIP',
			'team_power'	=>	1,
			'condition'		=>	[
				'authen'	=>	true,
				'power'		=>	0,
				'member'	=>	[
				],
				'direct'	=>	0,
				'direct_authen'	=>	true,
				'people'	=>	0,
				'shop'		=>	[
					'machine'	=>	true,
				],
			],
			'reward'		=>	[
				'money'		=>	0,
				'machine'	=>	[],
				'power'		=>	0,
			],
			'profit'		=>	[
			],
			'trade'			=>	[
			],
			'commission'	=>	[
				1			=>	0.1,
				2			=>	0.05,
				/*1			=>	[
					'percent' 	=>	0.1,
					'direct'	=>	1,
				],
				2			=>	[
					'percent' 	=>	0.05,
					'direct'	=>	4,
				],*/
			],
			'bonus'			=>	0,
			'scratch'		=>	2,											// 拥有刮刮卡的机会
		],
		[
			'name'			=>	'宽客联盟',
			'team_power'	=>	1,
			'condition'		=>	[
				'authen'	=>	true,
				'power'		=>	0,
				'member'	=>	[],
				'direct'	=>	1,
				'direct_authen'	=>	true,									// 直推人数是否要求是已认证的
				'direct_lv'	=>	[											// 直推成员要求，例如Lv1 N个，Lv2 N个
				],
				'people'	=>	0,
			],
			'reward'		=>	[
				'money'		=>	0,
				'machine'	=>	[],
				'power'		=>	0,
			],
			'profit'		=>	[
			],
			'trade'			=>	[
			],
			'commission'	=>	[
				1			=>	0.1,
				2			=>	0.05,
			],
			'bonus'			=>	0,
			'scratch'		=>	3,											// 拥有刮刮卡的机会
		],
		/*[
			'name'			=>	'联盟理事',
			'team_power'	=>	1,
			'condition'		=>	[
				'authen'	=>	true,
				'power'		=>	60,
				'member'	=>	[],
				'direct'	=>	10,
				'direct_authen'	=>	true,
				'people'	=>	30,
			],
			'reward'		=>	[
				'money'		=>	0,
				'machine'	=>	[],
				'power'		=>	0,
			],
			'profit'		=>	[
			],
			'trade'			=>	[
			],
			'commission'	=>	[
				1			=>	0.08,
				2			=>	0.03,
			],
			'bonus'			=>	0.1,
		],
		[
			'name'			=>	'联盟大使',
			'team_power'	=>	1,
			'condition'		=>	[
				'authen'	=>	true,
				'power'		=>	200,
				'member'	=>	[],
				'direct'	=>	0,
				'direct_authen'	=>	true,
				'direct_lv'	=>	[
					3		=>	3,
				],
				'people'	=>	0,
			],
			'reward'		=>	[
				'money'		=>	0,
				'machine'	=>	[],
				'power'		=>	0,
			],
			'profit'		=>	[
			],
			'trade'			=>	[
			],
			'commission'	=>	[
				1			=>	0.09,
				2			=>	0.03,
			],
			'bonus'			=>	0.15,
		],
		[
			'name'			=>	'联盟董事',
			'team_power'	=>	1,
			'condition'		=>	[
				'authen'	=>	true,
				'power'		=>	600,
				'member'	=>	[],
				'direct'	=>	0,
				'direct_authen'	=>	true,
				'direct_lv'	=>	[
					4		=>	3,
				],
				'people'	=>	0,
			],
			'reward'		=>	[
				'money'		=>	0,
				'machine'	=>	[],
				'power'		=>	0,
			],
			'profit'		=>	[
			],
			'trade'			=>	[
			],
			'commission'	=>	[
				1			=>	0.1,
				2			=>	0.03,
			],
			'bonus'			=>	0.2,
		],*/
	],

	'sms'					=>	[											// 短信配置

		// 必填通用项
		'length'			=>	6,											// 验证码长度
		'refresh_in'		=>	60,											// 刷新时间，秒
		'expires_in'		=>	60 * 30,									// 有效时间，秒
		'verify_temp_id'	=>	251292,										// 模板编号，需要是数字

		// 选填云通讯
		'account_sid'		=>	'8a216da8645fab0e016463c0d41a015e',			// 下面六行属于云通讯的
		'auth_token'		=>	'31922fab7fc3471facb25c31594e5ef3',
		'rest_url'			=>	'https://app.cloopen.com:8883',
		'appid'				=>	'8a216da8645fab0e016463c0d47e0165',
		'apptoken'			=>	'',
		'version'			=>	'2013-12-26',

		// 选填阿里云
		/*'aliyun'			=>	[											// 下面属于阿里云的
			'SignName'			=>	'',
			'TemplateCode'		=>	'',
			'accessKeyId'		=>	'',
			'accessKeySecret'	=>	'',
			'security'			=>	true,
			'domain'			=>	'dysmsapi.aliyuncs.com',
		],*/

		// 选填、其他运营商
		'other'				=>	[
			'account_sid'	=>	'2e26a7b8cb2d4a9eab45d4149db12760',
			'auth_token'	=>	'3e6ef30af6774b45befc8b5b67d285d0',
			'rest_url'		=>	'https://api.miaodiyun.com/20150822/',
		],
	],

	'exchange_key'			=>	'',

	'businesses'			=>	[											// 所有业务类型
		10					=>	'交易买入',
		11					=>	'交易卖出',
		12					=>	'交易取消',
		13					=>	'转账转出',
		14					=>	'转账转入',
		15					=>	'imtoken充值',
		16					=>	'imtoken提现',
		17					=>	'imtoken提现失败',
		18					=>	'共享矿池',
		19					=>	'购买算力道具',
		20					=>	'激活引擎',
		21					=>	'引擎收益',
		22					=>	'商城购物',
		23					=>	'刮刮卡',
		24					=>	'商城收益',
		29					=>	'联盟收益',
		30					=>	'团队引擎收益',
		31					=>	'团队交易收益',
		32					=>	'全球交易分红',
		33					=>	'链上合约 - 一口价',
		34					=>	'链上合约 - 团购',
		35					=>	'链上合约 - 转让',
		36					=>	'链上合约 - 出售',
		37					=>	'链上合约 - 收益',
		38					=>	'链上合约 - 佣金',
		39					=>	'链上合约 - 代理佣金',
		40					=>	'参与众筹',
		41					=>	'众筹成功',
		42					=>	'众筹取消',
		50					=>	'升级奖励',
		88					=>	'系统奖励',
	],

	'log'					=>	[											// 日志类型，不建议修改
		1					=>	'注册并登录',
		2					=>	'注册账户',
		3					=>	'登录账户',
		4					=>	'找回密码',
		5					=>	'修改登录密码',
		6					=>	'修改安全密码',
		7					=>	'更新资料',
		8					=>	'实名认证',
		9					=>	'退出登录',
		10					=>	'管理员更新用户资料',
		11					=>	'管理员调整用户资金',
		12					=>	'管理员审核实名认证',
		13					=>	'管理员修改用户密码',
		14					=>	'管理员调整用户级别',
		15					=>	'管理员调整用户状态',
		16					=>	'QQ快速登录',
		17					=>	'微信快速登录',
		20					=>	'刮刮卡',
		21					=>	'刮刮卡提货',
		30					=>	'购买引擎',
		31					=>	'一键收矿',
		32					=>	'商城购物',
		60					=>	'交易买入',
		61					=>	'交易卖出',
		62					=>	'用户转账',
		63					=>	'每日签到',
		64					=>	'imtoken充值',
		65					=>	'imtoken提现',
		66					=>	'共享矿池 - 领取收益',
		67					=>	'算力道具',
	],

	'default_currency'		=>	1,											// 默认货币
	'currencys'				=>	[											// 货币集合
		1					=>	[
			'name'			=>	'可用AMA',									// 货币名称
			'field'			=>	'money',									// 数据库字段
			'businesses'	=>	[10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21, 22, 23, 24, 29, 50, 80, 81, 82],		// 参与业务
		],
		2					=>	[
			'name'			=>	'冻结AMA',
			'field'			=>	'deposit',
			'businesses'	=>	[11, 12, 80, 81, 82],
		],
		3					=>	[
			'name'			=>	'可用积分',
			'field'			=>	'score',
			'businesses'	=>	[20, 22, 24, 88],
		],
		4					=>	[
			'name'			=>	'冻结积分',
			'field'			=>	'score_deposit',
			'businesses'	=>	[20, 22, 24, 88],
		],
	],
	'score'					=>	[											// 积分配置
		'enable'			=>	false,										// 是否启用
		'unit'				=>	'积分',										// 单位
	],

	'trade'					=>	[											// 交易配置
		/*'time'				=>	[											// 开盘时间
			[
				'open'		=>	'00:00:00',
				'close'		=>	'23:59:00',
			],
			[
				'open'		=>	'13:00:00',
				'close'		=>	'15:00:00',
			],
			[
				'open'		=>	'20:00:00',
				'close'		=>	'22:00:00',
			],
		],*/
		'limit'				=>	5,											// 每人未完成的订单买入卖出分别最多允许多少笔
		'charge'			=>	0.02,										// 交易手续费
		'buy'				=>	[											// 买入配置
			'number'		=>	[											// 买入数量
				'max'		=>	100,										// 最多买入数量
				'min'		=>	10,											// 最少买入数量
			],
			'allow'			=>	[],											// 为空表示不限制，在这里添加账号，表示只允许这部分人出售
		],
		'sell'				=>	[											// 卖出配置
			'number'		=>	[											// 卖出数量
				'max'		=>	100,										// 最多卖出数量
				'min'		=>	10,											// 最少卖出数量
			],
			'allow'			=>	[											// 为空表示不限制，在这里添加账号，表示只允许这部分人出售
			],

		],
		'status'			=>	[											// 订单状态
			0	=>	[
				'name' 		=>	'已取消',									// 状态类型
			],
			1	=>	[
				'name' 		=> 	'匹配中',
			],
			2	=>	[
				'name' 		=> 	'待付款',
			],
			3	=>	[
				'name' 		=> 	'待确认',
			],
			4	=>	[
				'name' 		=> 	'投诉中',
			],
			8	=>	[
				'name' 		=> 	'成交',
			],
		],
	],

	'transfer'				=>	[											// 转账配置
		/*'charge'			=>	[											// 手续费
			'percent' 		=>	0.05,
			'min'			=>	5,
			'max'			=>	10,
		],*/
		'charge'			=>	0.005,
		'min'				=>	100,
	],

	'event'					=>	[											// 活动配置
		'scratch'			=>	[											// 刮刮卡
			'enable'			=>	true,									// 是否开启
			'chance'			=>	[										// 机会配置
				'people'		=>	1,										// 每满20人，增加一次机会，为0代表机会无限
			],
			'reward'			=>	[										// 奖品配置
				[
					'id'		=>	1003,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'Lv1托管引擎',								// 奖品名称
					'type'		=>	1,										// 类型，1：矿机，2：实物，3：话费
					'machine'	=>	1,										// 对应矿机的ID，类型为矿机时该项必填
					'percent'	=>	0.01,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	1000,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	1,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
				[
					'id'		=>	1002,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'0.02AMA',								// 奖品名称
					'value'		=>	0.02,
					'type'		=>	8,										// 类型，1：矿机，2：实物，3：话费
					'percent'	=>	0.7,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	5000,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	10,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
				[
					'id'		=>	1001,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'0.01AMA',								// 奖品名称
					'value'		=>	0.01,
					'type'		=>	8,										// 类型，1：矿机，2：实物，3：话费
					'percent'	=>	0.8,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	10000,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	10,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
				[
					'id'		=>	1005,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'0.001AMA',								// 奖品名称
					'value'		=>	0.001,
					'type'		=>	8,										// 类型，1：矿机，2：实物，3：话费
					'percent'	=>	0.8,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	10000,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	10,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
				[
					'id'		=>	1007,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'0.03AMA',								// 奖品名称
					'value'		=>	0.03,
					'type'		=>	8,										// 类型，1：矿机，2：实物，3：话费
					'percent'	=>	0.8,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	10000,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	10,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
				[
					'id'		=>	1006,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'0.0001AMA',								// 奖品名称
					'value'		=>	0.0001,
					'type'		=>	8,										// 类型，1：矿机，2：实物，3：话费
					'percent'	=>	1,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	10000,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	10,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
				[
					'id'		=>	1004,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'50元话费',								// 奖品名称
					'type'		=>	3,										// 类型，1：矿机，2：实物，3：话费
					'percent'	=>	0,										// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	0,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	0,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],
				[
					'id'		=>	1010,									// 奖品编号，可以自定义，但不能随便更改
					'name'		=>	'iPhoneX',								// 奖品名称
					'type'		=>	2,										// 类型，1：矿机，2：实物，3：话费
					'percent'	=>	0,									// 中奖概率，如果大于等于1，表示必中，如果小于等于0，表示永远不会中奖
					'number'	=>	0,									// 总数量
					'limit'		=>	[										// 中奖的限制
						'person'	=>	0,									// 每人最多中多少个
						'day'		=>	[1, 10],							// 所有人按天限制，【多少天内，最多中多少个】
					],
				],

			],
			'rule'				=>	[										// 活动规则，一条一行
				'奖品包括AMA、引擎、iPhoneX、话费等',
				'每分享1个认证用户，将会得到一次刮刮乐的机会',
				'实物将于7个工作日内发货，其他奖品立即到账',
				'解释权归平台所有',
			],
		],
		'pool'                  =>  [                   					// 共享矿池
            'enable'            =>  true,              					// 是否开启
            'volume'            =>  10000000,           					// 剩余容量
            'complexity'        =>  1850123315,         					// 起始复杂度
            'percent'			=>	0.00001,								// 算力和收益的比例，可以是0.0001比1，也可以是1比1
            'float'				=>	0.01,									// 浮动比例，比如收益100个货币，浮动0.01，最终可能是101，也可能是99
            'interval'			=>	60 * 60,								// 收益的时间间隔，单位是秒
            'background'		=>	'/static/image/pool/bg.png',			// 背景图片
        ],
	],

	'contact'				=>	[											// 联系我们
		'interval'			=>	60,											// 每次发言间隔，单位是秒
	],

	'oauth'					=>	[											// 第三方授权
		'wechat'			=>	[											// 微信授权
			'enable'		=>	false,										// 是否启用
		],
		'qq'				=>	[											// QQ授权
			'enable'		=>	false,										// 是否启用
			'appid'			=>	'101475973',
			'appkey'		=>	'59b3aa4c3a474bc0fabc550381fe590a',
		],
	],

	'store'					=>	[											// 商城配置
		'seller'			=>	[											// 商家服务
			'enable'		=>	false,										// 是否开启
			'catalog'		=>	[4, 5, 6],									// 允许发布的类目
			'limit'			=>	[											// 每人允许发布的商品数量
				1			=>	1,											// 1级可发1个
				2			=>	1,											// 2级可发2个
				3			=>	1,
				4			=>	1,
				5			=>	1,
				6			=>	1,
				7			=>	1,
				8			=>	1,
			],
			'charge'		=>	0.2,										// 成交手续费
		],
		'catalog'			=>	[											// 产品类目
			1 				=>	'引擎',										// 1固定为矿机，只能改名字
			2 				=>	'道具',										// 2固定为道具，只能改名字
			3 				=>	'精品',										// 3固定为官方发布的产品，只能改名字
			4 				=>	'生活',										// 从4起，可以是用户自己发布的产品，可自由更改添加
			5 				=>	'数码',
		],
		'machine'			=>	[											// 矿机配置
			'activation'	=>	false,										// 购买矿机是否需要使用激活码
			'rebate'		=>	true,										// 购买矿机是否立即返利给上级
		],
	],

	'contract'				=>	[											// 合约配置
		'enable'			=>	true,										// 是否开启
		'agent'				=>	[],											// 代理商列表，用户账号 => 比例
		'commission'		=>	0.02,										// 佣金比例
		'catalog'			=>	[
			1				=>	'名人',
			2				=>	'书画',
			3				=>	'古董',
			4				=>	'品牌',
			5				=>	'宠物',
			6				=>	'游戏',
			7				=>	'汽车',
		],
	],

	'funding'				=>	[											// 众筹配置
		'enable'			=>	true,										// 是否开启
		'charge'			=>	0.2,										// 手续费
		'expire'			=>	15,											// 项目默认15天到期
		'audit'				=>	true,										// 是否需要审核
		'catalog'			=>	[
			1				=>	'创业',
			2				=>	'公益',
			3				=>	'慈善',
		],
		'condition'			=>	[											// 发布条件
			49999			=>	1000,										// 发布小于等于49999的，需要在投入最少1000货币
			99999			=>	5000,
			499999			=>	10000,
			999999			=>	50000,
			PHP_INT_MAX		=>	100000,
		],
		'level'				=>	[											// 用户档次
			[1000, 4999], [5000, 9999], [10000, 49999], [50000, 99999], [100000, PHP_INT_MAX],
		],
		'max'				=>	10000000,
	],
];